{
    "십성": {
        "비견": {
            "오행": "일간과 같은 오행",
            "음양": "일간과 같은 음양",
            "설명": "나와 같은 오행의 기운으로, 형제, 자매, 친구, 동료를 의미합니다. 자존심이 강하고 독립적이며 주체성이 있습니다. 경쟁심도 강할 수 있습니다."
        },
        "겁재": {
            "오행": "일간과 같은 오행",
            "음양": "일간과 다른 음양",
            "설명": "나와 같은 오행이지만 음양이 다른 기운으로, 경쟁자, 협력자, 때로는 재물 경쟁을 의미합니다. 투쟁심과 욕심이 있어 승부욕이 강합니다."
        },
        "식신": {
            "오행": "일간이 생하는 오행",
            "음양": "일간과 같은 음양",
            "설명": "나의 기운을 설계하는 기운으로, 의식주, 재능, 창의력, 여유, 복을 의미합니다. 낙천적이고 베풀기를 좋아하며, 예술적 재능이 있을 수 있습니다."
        },
        "상관": {
            "오행": "일간이 생하는 오행",
            "음양": "일간과 다른 음양",
            "설명": "나의 기운을 설계하지만 틀을 깨려는 기운으로, 표현력, 반항심, 비판적 사고, 독창성을 의미합니다. 언변이 뛰어나고 총명하나, 고집이 강할 수 있습니다."
        },
        "편재": {
            "오행": "일간이 극하는 오행",
            "음양": "일간과 다른 음양",
            "설명": "내가 관리하는 넓은 범위의 재물, 투기성 재물, 사업운, 유흥 등을 의미합니다. 활동적이고 재물에 대한 욕심이 강하며, 수완이 좋습니다."
        },
        "정재": {
            "오행": "일간이 극하는 오행",
            "음양": "일간과 같은 음양",
            "설명": "나의 노력으로 얻는 안정적인 재물, 월급, 고정 수입, 배우자 등을 의미합니다. 성실하고 절약정신이 있으며, 계획적인 성향을 가집니다."
        },
        "편관": {
            "오행": "일간을 극하는 오행",
            "음양": "일간과 다른 음양",
            "설명": "나를 억압하고 통제하는 기운으로, 권력, 명예, 직업, 책임감, 고난 등을 의미합니다. 카리스마 있고 리더십이 강하나, 스트레스에 취약할 수 있습니다."
        },
        "정관": {
            "오행": "일간을 극하는 오행",
            "음양": "일간과 같은 음양",
            "설명": "나를 바르게 통제하고 보호하는 기운으로, 법, 규칙, 직장, 명예, 배우자 등을 의미합니다. 성실하고 원칙주의적이며, 도덕성이 뛰어납니다."
        },
        "편인": {
            "오행": "일간을 생하는 오행",
            "음양": "일간과 다른 음양",
            "설명": "나를 생하지만 비정상적인 방법으로 생하는 기운으로, 독특한 학문, 기술, 예술, 직감, 고독 등을 의미합니다. 예민하고 창의적이며, 비판적인 성향을 가집니다."
        },
        "정인": {
            "오행": "일간을 생하는 오행",
            "음양": "일간과 같은 음양",
            "설명": "나를 바르게 생하는 기운으로, 학문, 문서, 인덕, 어머니, 명예 등을 의미합니다. 지혜롭고 인자하며, 인정이 많고 학구적인 성향을 가집니다."
        }
    },
    "신살": {
        "도화살": {
            "조건": "년지/일지 기준 자오묘유",
            "설명": "이성에게 인기가 많고 매력적이며, 사람들의 시선을 끄는 능력이 있습니다. 연예계나 인기 직업과 인연이 깊을 수 있습니다."
        },
        "역마살": {
            "조건": "년지/일지 기준 인신사해",
            "설명": "이동과 변화를 즐기며 역동적인 삶을 삽니다. 해외 운이나 이사, 여행 등 이동수가 많고, 활동적인 직업에 잘 맞습니다."
        },
        "화개살": {
            "조건": "년지/일지 기준 진술축미",
            "설명": "예술적 감각과 재능이 뛰어나며, 고독을 즐기거나 종교, 철학 분야에 관심이 많습니다. 과거를 회상하며 추억에 잠기기도 합니다."
        },
        "고진살": {
            "설명": "남자는 배우자 복이 박하거나 외로움을 느낄 수 있고, 여자는 홀로됨을 암시하기도 합니다. 이성 관계에서 어려움이 따를 수 있습니다."
        },
        "과숙살": {
            "설명": "여자는 배우자 복이 박하거나 외로움을 느낄 수 있고, 남자는 홀로됨을 암시하기도 합니다. 이성 관계에서 어려움이 따를 수 있습니다."
        }
    },
    "오행설명": {
        "木": "생장, 발전, 시작을 의미합니다. 인자하고 진취적인 성향이 있으며, 계획하고 추진하는 능력이 뛰어납니다.",
        "火": "열정, 활동, 빛을 의미합니다. 명랑하고 예의 바르며, 활발한 대인 관계를 통해 자신을 드러내는 것을 좋아합니다.",
        "土": "중용, 안정, 신뢰를 의미합니다. 포용력 있고 인내심 강하며, 믿음직하고 중재 역할을 잘 합니다.",
        "金": "정의, 의리, 결실을 의미합니다. 냉철하고 단호하며, 실천력이 뛰어나고 의리를 중요하게 생각합니다.",
        "水": "지혜, 유연, 비밀을 의미합니다. 총명하고 융통성 있으며, 사려 깊고 변화에 잘 적응합니다."
    },
    "일간설명": {
        "甲": "양목(陽木): 큰 나무와 같습니다. 리더십이 강하고, 곧고 올곧은 성품을 지녔습니다. 추진력이 뛰어나고 강인합니다.",
        "乙": "음목(陰木): 부드러운 풀과 같습니다. 유연하고 친화력이 좋으며, 생존력이 강합니다. 협력적이고 온화한 성향을 가집니다.",
        "丙": "양화(陽火): 태양과 같습니다. 열정적이고 활동적이며 솔직하고 명랑합니다. 타인을 밝혀주는 역할을 합니다.",
        "丁": "음화(陰火): 촛불이나 달빛과 같습니다. 섬세하고 총명하며, 예리한 통찰력을 지녔습니다. 내면의 빛을 발산합니다.",
        "戊": "양토(陽土): 큰 산과 같습니다. 믿음직하고 듬직하며, 포용력이 넓습니다. 안정적이고 변화를 싫어하는 경향이 있습니다.",
        "己": "음토(陰土): 밭이나 논과 같습니다. 현실적이고 실리적이며, 끈기 있고 성실합니다. 실제적인 능력을 발휘합니다.",
        "庚": "양금(陽金): 큰 바위나 철광석과 같습니다. 강직하고 의리 있으며, 결단력이 뛰어납니다. 개혁적이고 추진력이 강합니다.",
        "辛": "음금(陰金): 보석이나 칼과 같습니다. 섬세하고 깔끔하며, 예리한 분석력을 지녔습니다. 재능이 뛰어나고 완벽주의적인 성향을 가집니다.",
        "壬": "양수(陽水): 큰 강이나 바다와 같습니다. 지혜롭고 통이 크며, 유연하고 포용력이 넓습니다. 자유로운 영혼을 추구합니다.",
        "癸": "음수(陰水): 이슬이나 빗물과 같습니다. 총명하고 감수성이 풍부하며, 적응력이 뛰어납니다. 내성적이고 신비로운 매력이 있습니다."
    }
}
